% 1.(1)将100个学生5门功课的成绩存入矩阵p中，分别求每门功课的最高分、最低分及相应的学生序号。
% (2)分别求每门功课的平均分和标准方差。
% (3)5门功课总分的最高分、最低分及相应的学号。
% (4)将5门功课总分按从大到小顺序存入zcj中，相应学生序号存入xsxh。

p = rand([100,5]) * 100;
[max, max_index] = max(p)
[min, min_index] = min(p) % (1)

m = mean(p)
s = std(p)
v = var(p) % (2)

total = sum(p,2);
[max_total, max_index_total] = max(total)
[min_total, min_index_total] = min(total) % (3)

[zcj, xsxh] = sort(total, 'descend'); % (4)


% 2. 某气象观测站测得某日6:00~18:00之间每2h的室内外温度(℃)如实验表1所示：
% 实验表1 室内外温度观测结果(℃)
% 时间h    6    8   10  12   14  16  18
% 室内温度t1   18.0   20.0   22.0   25.0   30.0  28.0   24.0
% 室内温度t2   15.0   19.0   24.0   28.0   34.0  32.0   30.0
% 试用三次样条插值分别求出该日室内外6:30~17::30之间每隔2h各点的近似温度(℃)，进行3阶拟合及画出拟合曲线。

h = [6 8 10 12 14 16 18];
t1 = [18.0 20.0 22.0 25.0 30.0 28.0 24.0];
t2 = [15.0 19.0 24.0 28.0 34.0 32.0 30.0];

h1 = 6.5:2:17.5;
y1 = spline(h,t1,h1)
y2 = spline(h,t2,h1)

f1 = polyfit(h,t1,3)
f2 = polyfit(h,t2,3)
H = linspace(6,18);
Y1 = polyval(f1,H);
Y2 = polyval(f2,H);
plot(H,Y1,H,Y2)



% 3. 已知lgx在[1,101]区间10个整数采样点的函数如实验表2所示：
% 实验表2  lgx在10个采样点的函数值
% x 1  11   21  31  41  51  61  71  81  91 101
% lgx 0  1.0414 1.3222 1.4914 1.6128 1.7076 1.7853 1.8513 1.9085 1.9590 2.0043
% 试求lgx的5次拟合多项式 ，并绘制出lgx和 在[1,101]区间的函数曲线。

x = [1 11 21 31 41 51 61 71 81 91 101];
lgx = [0 1.0414 1.3222 1.4914 1.6128 1.7076 1.7853 1.8513 1.9085 1.9590 2.0043];

p = polyfit(x,lgx,5)

X = linspace(1,101);
Y = polyval(p,X);
plot(X,Y)

% 4. 有3个多项式 ， ， ，试进行下列操作：
% （1）求 。
% （2）求 的根。
% （3）当x取矩阵A的每一元素时，求 的值。其中
% （4）当以矩阵A为自变量时，求 的值。其中A的值与(3)相同。

P1 = str2sym('x^4+2*x^3+4*x^2+5');
P2 = str2sym('x+2');
P3 = str2sym('x^2+2*x+3');
P = P1 + P2 * P3 % （1）
simplify(P)

r = double(root(P)) % （2）

A = [-1 1.2 -1.4;0.75 2 3.5;0 5 2.5];
xa = subs(P,A(:)') % （3）

xA = subs(P,A) % （4）


P1 = [1 2 4 0 5]
P2 = [0 0 0 1 2]
P3 = [0 0 1 2 3]
tP = conv(P2, P3)
P = P1 + tP(end-4:end)

r = roots(P)
A = [-1 1.2 -1.4;0.75 2 3.5;0 5 2.5];
xa = polyval(P, A)
xA = polyval(P, A(:))



